In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {
    'A':[1,2,np.nan],
    'B':[5, np.nan, np.nan],
    'C':[1, 2,3 ],
    'D':[np.nan, np.nan, np.nan]
}

In [3]:
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3], 'D': [nan, nan, nan]}

In [4]:
df = pd.DataFrame(d)

In [5]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [6]:
df.dropna() # row; axis=0 (Default)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [7]:
df.dropna(axis=1) # columns

   C
0  1
1  2
2  3

In [8]:
df.dropna(thresh=2)

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN

In [9]:
df.dropna(how='any') # remove as linhas ou colunas
# que possuem qlqr valor vazio

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [10]:
df.dropna(how='all', axis=1)
# remove as linhas ou colunas
# que possuem todos valores vazios

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [11]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [12]:
df.fillna(value='FILL VALUE')

            A           B  C           D
0         1.0         5.0  1  FILL VALUE
1         2.0  FILL VALUE  2  FILL VALUE
2  FILL VALUE  FILL VALUE  3  FILL VALUE

In [13]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN

In [14]:
df["A"].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [15]:
df

     A    B  C   D
0  1.0  5.0  1 NaN
1  2.0  NaN  2 NaN
2  NaN  NaN  3 NaN